podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL27Z644-FRDM.h
// </h>

// <h> Port D Pins

// Signal mapping for PTD0 pin
//   <o>    PTD0<name=PTD0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD0 pin
//   <info> GPIOD_0, SPI0_PCS0, TPM0_CH0, FXIO0_D0
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_0<selection=GPIOD_0_PIN_SEL,PTD0>
//     <2=> SPI0_PCS0<selection=SPI0_PCS0_PIN_SEL,PTD0>
//     <4=> TPM0_CH0<selection=TPM0_CH0_PIN_SEL,PTD0>
//     <6=> FXIO0_D0<selection=FXIO0_D0_PIN_SEL,PTD0>
//     <-2=> Default
#define PTD0_SIG_SEL         -2

// Signal mapping for PTD1 pin
//   <o>    PTD1<name=PTD1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD1 pin
//   <info> ADC0_SE5b, GPIOD_1, SPI0_SCK, TPM0_CH1, FXIO0_D1
//     <-2=> ADC0_SE5b (reset default)<selection=ADC0_SE5b_PIN_SEL,PTD1 (reset default)>
//     <0=> ADC0_SE5b<selection=ADC0_SE5b_PIN_SEL,PTD1>
//     <1=> GPIOD_1<selection=GPIOD_1_PIN_SEL,PTD1>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTD1>
//     <4=> TPM0_CH1<selection=TPM0_CH1_PIN_SEL,PTD1>
//     <6=> FXIO0_D1<selection=FXIO0_D1_PIN_SEL,PTD1>
//     <-2=> Default
#define PTD1_SIG_SEL         -2

// Signal mapping for PTD2 pin
//   <o>    PTD2<name=PTD2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD2 pin
//   <info> GPIOD_2, SPI0_MOSI, UART2_RX, TPM0_CH2, SPI0_MISO, FXIO0_D2
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_2<selection=GPIOD_2_PIN_SEL,PTD2>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD2>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD2>
//     <4=> TPM0_CH2<selection=TPM0_CH2_PIN_SEL,PTD2>
//     <5=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD2>
//     <6=> FXIO0_D2<selection=FXIO0_D2_PIN_SEL,PTD2>
//     <-2=> Default
#define PTD2_SIG_SEL         -2

// Signal mapping for PTD3 pin
//   <o>    PTD3<name=PTD3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD3 pin
//   <info> GPIOD_3, SPI0_MISO, UART2_TX, TPM0_CH3, SPI0_MOSI, FXIO0_D3
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_3<selection=GPIOD_3_PIN_SEL,PTD3>
//     <2=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD3>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD3>
//     <4=> TPM0_CH3<selection=TPM0_CH3_PIN_SEL,PTD3>
//     <5=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD3>
//     <6=> FXIO0_D3<selection=FXIO0_D3_PIN_SEL,PTD3>
//     <-2=> Default
#define PTD3_SIG_SEL         -2

// Signal mapping for PTD4 pin
//   <o>    PTD4<name=PTD4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD4 pin
//   <info> GPIOD_4/LLWU_P14, SPI1_PCS0, UART2_RX, TPM0_CH4, FXIO0_D4
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_4/LLWU_P14<selection=GPIOD_4_PIN_SEL,PTD4><selection=LLWU_P14_PIN_SEL,PTD4>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTD4>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD4>
//     <4=> TPM0_CH4<selection=TPM0_CH4_PIN_SEL,PTD4>
//     <6=> FXIO0_D4<selection=FXIO0_D4_PIN_SEL,PTD4>
//     <-2=> Default
#define PTD4_SIG_SEL         -2

// Signal mapping for PTD5 pin
//   <o>    PTD5<name=PTD5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD5 pin
//   <info> ADC0_SE6b, GPIOD_5, SPI1_SCK, UART2_TX, TPM0_CH5, FXIO0_D5
//     <-2=> ADC0_SE6b (reset default)<selection=ADC0_SE6b_PIN_SEL,PTD5 (reset default)>
//     <0=> ADC0_SE6b<selection=ADC0_SE6b_PIN_SEL,PTD5>
//     <1=> GPIOD_5<selection=GPIOD_5_PIN_SEL,PTD5>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTD5>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD5>
//     <4=> TPM0_CH5<selection=TPM0_CH5_PIN_SEL,PTD5>
//     <6=> FXIO0_D5<selection=FXIO0_D5_PIN_SEL,PTD5>
//     <-2=> Default
#define PTD5_SIG_SEL         -2

// Signal mapping for PTD6 pin
//   <o>    PTD6 (Alias:D14, ONBOARD_SDA)<name=PTD6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD6 pin
//   <info> ADC0_SE7b, GPIOD_6/LLWU_P15, SPI1_MOSI, LPUART0_RX, I2C1_SDA, SPI1_MISO, FXIO0_D6
//     <-2=> ADC0_SE7b (reset default)<selection=ADC0_SE7b_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA) (reset default)>
//     <0=> ADC0_SE7b<selection=ADC0_SE7b_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <1=> GPIOD_6/LLWU_P15<selection=GPIOD_6_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)><selection=LLWU_P15_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <3=> LPUART0_RX<selection=LPUART0_RX_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <4=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <6=> FXIO0_D6<selection=FXIO0_D6_PIN_SEL,PTD6 (Alias:D14, ONBOARD_SDA)>
//     <4=> Default
#define PTD6_SIG_SEL         4

// Signal mapping for PTD7 pin
//   <o>    PTD7 (Alias:D15, ONBOARD_SCL)<name=PTD7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD7 pin
//   <info> GPIOD_7, SPI1_MISO, LPUART0_TX, I2C1_SCL, SPI1_MOSI, FXIO0_D7
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_7<selection=GPIOD_7_PIN_SEL,PTD7 (Alias:D15, ONBOARD_SCL)>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD7 (Alias:D15, ONBOARD_SCL)>
//     <3=> LPUART0_TX<selection=LPUART0_TX_PIN_SEL,PTD7 (Alias:D15, ONBOARD_SCL)>
//     <4=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTD7 (Alias:D15, ONBOARD_SCL)>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD7 (Alias:D15, ONBOARD_SCL)>
//     <6=> FXIO0_D7<selection=FXIO0_D7_PIN_SEL,PTD7 (Alias:D15, ONBOARD_SCL)>
//     <4=> Default
#define PTD7_SIG_SEL         4

// </h>

// <h> Port E Pins

// Signal mapping for PTE0 pin
//   <o>    PTE0<name=PTE0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE0 pin
//   <info> GPIOE_0/CLKOUT32K, SPI1_MISO, LPUART1_TX, RTC_CLKOUT, CMP0_OUT, I2C1_SDA
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_0/CLKOUT32K<selection=GPIOE_0_PIN_SEL,PTE0><selection=CLKOUT32K_PIN_SEL,PTE0>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTE0>
//     <3=> LPUART1_TX<selection=LPUART1_TX_PIN_SEL,PTE0>
//     <4=> RTC_CLKOUT<selection=RTC_CLKOUT_PIN_SEL,PTE0>
//     <5=> CMP0_OUT<selection=CMP0_OUT_PIN_SEL,PTE0>
//     <6=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTE0>
//     <-2=> Default
#define PTE0_SIG_SEL         -2

// Signal mapping for PTE1 pin
//   <o>    PTE1<name=PTE1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE1 pin
//   <info> GPIOE_1, SPI1_MOSI, LPUART1_RX, SPI1_MISO, I2C1_SCL
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_1<selection=GPIOE_1_PIN_SEL,PTE1>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTE1>
//     <3=> LPUART1_RX<selection=LPUART1_RX_PIN_SEL,PTE1>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTE1>
//     <6=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTE1>
//     <-2=> Default
#define PTE1_SIG_SEL         -2

// Signal mapping for PTE16 pin
//   <o>    PTE16 (Alias:A0)<name=PTE16_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE16 pin
//   <info> ADC0_DP1/ADC0_SE1, GPIOE_16, SPI0_PCS0, UART2_TX, TPM_CLKIN0, FXIO0_D0
//     <-2=> ADC0_DP1/ADC0_SE1 (reset default)<selection=ADC0_DP1_PIN_SEL,PTE16 (Alias:A0) (reset default)><selection=ADC0_SE1_PIN_SEL,PTE16 (Alias:A0) (reset default)>
//     <0=> ADC0_DP1/ADC0_SE1<selection=ADC0_DP1_PIN_SEL,PTE16 (Alias:A0)><selection=ADC0_SE1_PIN_SEL,PTE16 (Alias:A0)>
//     <1=> GPIOE_16<selection=GPIOE_16_PIN_SEL,PTE16 (Alias:A0)>
//     <2=> SPI0_PCS0<selection=SPI0_PCS0_PIN_SEL,PTE16 (Alias:A0)>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTE16 (Alias:A0)>
//     <4=> TPM_CLKIN0<selection=TPM_CLKIN0_PIN_SEL,PTE16 (Alias:A0)>
//     <6=> FXIO0_D0<selection=FXIO0_D0_PIN_SEL,PTE16 (Alias:A0)>
//     <0=> Default
#define PTE16_SIG_SEL        0

// Signal mapping for PTE17 pin
//   <o>    PTE17<name=PTE17_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE17 pin
//   <info> ADC0_DM1/ADC0_SE5a, GPIOE_17, SPI0_SCK, UART2_RX, TPM_CLKIN1, LPTMR0_ALT3, FXIO0_D1
//     <-2=> ADC0_DM1/ADC0_SE5a (reset default)<selection=ADC0_DM1_PIN_SEL,PTE17 (reset default)><selection=ADC0_SE5a_PIN_SEL,PTE17 (reset default)>
//     <0=> ADC0_DM1/ADC0_SE5a<selection=ADC0_DM1_PIN_SEL,PTE17><selection=ADC0_SE5a_PIN_SEL,PTE17>
//     <1=> GPIOE_17<selection=GPIOE_17_PIN_SEL,PTE17>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTE17>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTE17>
//     <4=> TPM_CLKIN1<selection=TPM_CLKIN1_PIN_SEL,PTE17>
//     <5=> LPTMR0_ALT3<selection=LPTMR0_ALT3_PIN_SEL,PTE17>
//     <6=> FXIO0_D1<selection=FXIO0_D1_PIN_SEL,PTE17>
//     <-2=> Default
#define PTE17_SIG_SEL        -2

