podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL27Z644-FRDM.h
// Signal mapping for PTE18 pin
//   <o>    PTE18<name=PTE18_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE18 pin
//   <info> ADC0_DP2/ADC0_SE2, GPIOE_18, SPI0_MOSI, I2C0_SDA, SPI0_MISO, FXIO0_D2
//     <-2=> ADC0_DP2/ADC0_SE2 (reset default)<selection=ADC0_DP2_PIN_SEL,PTE18 (reset default)><selection=ADC0_SE2_PIN_SEL,PTE18 (reset default)>
//     <0=> ADC0_DP2/ADC0_SE2<selection=ADC0_DP2_PIN_SEL,PTE18><selection=ADC0_SE2_PIN_SEL,PTE18>
//     <1=> GPIOE_18<selection=GPIOE_18_PIN_SEL,PTE18>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTE18>
//     <4=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTE18>
//     <5=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTE18>
//     <6=> FXIO0_D2<selection=FXIO0_D2_PIN_SEL,PTE18>
//     <-2=> Default
#define PTE18_SIG_SEL        -2

// Signal mapping for PTE20 pin
//   <o>    PTE20 (Alias:A2)<name=PTE20_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE20 pin
//   <info> ADC0_DP0/ADC0_SE0, GPIOE_20, TPM1_CH0, LPUART0_TX, FXIO0_D4
//     <-2=> ADC0_DP0/ADC0_SE0 (reset default)<selection=ADC0_DP0_PIN_SEL,PTE20 (Alias:A2) (reset default)><selection=ADC0_SE0_PIN_SEL,PTE20 (Alias:A2) (reset default)>
//     <0=> ADC0_DP0/ADC0_SE0<selection=ADC0_DP0_PIN_SEL,PTE20 (Alias:A2)><selection=ADC0_SE0_PIN_SEL,PTE20 (Alias:A2)>
//     <1=> GPIOE_20<selection=GPIOE_20_PIN_SEL,PTE20 (Alias:A2)>
//     <3=> TPM1_CH0<selection=TPM1_CH0_PIN_SEL,PTE20 (Alias:A2)>
//     <4=> LPUART0_TX<selection=LPUART0_TX_PIN_SEL,PTE20 (Alias:A2)>
//     <6=> FXIO0_D4<selection=FXIO0_D4_PIN_SEL,PTE20 (Alias:A2)>
//     <0=> Default
#define PTE20_SIG_SEL        0

// Signal mapping for PTE21 pin
//   <o>    PTE21 (Alias:A3)<name=PTE21_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE21 pin
//   <info> ADC0_DM0/ADC0_SE4a, GPIOE_21, TPM1_CH1, LPUART0_RX, FXIO0_D5
//     <-2=> ADC0_DM0/ADC0_SE4a (reset default)<selection=ADC0_DM0_PIN_SEL,PTE21 (Alias:A3) (reset default)><selection=ADC0_SE4a_PIN_SEL,PTE21 (Alias:A3) (reset default)>
//     <0=> ADC0_DM0/ADC0_SE4a<selection=ADC0_DM0_PIN_SEL,PTE21 (Alias:A3)><selection=ADC0_SE4a_PIN_SEL,PTE21 (Alias:A3)>
//     <1=> GPIOE_21<selection=GPIOE_21_PIN_SEL,PTE21 (Alias:A3)>
//     <3=> TPM1_CH1<selection=TPM1_CH1_PIN_SEL,PTE21 (Alias:A3)>
//     <4=> LPUART0_RX<selection=LPUART0_RX_PIN_SEL,PTE21 (Alias:A3)>
//     <6=> FXIO0_D5<selection=FXIO0_D5_PIN_SEL,PTE21 (Alias:A3)>
//     <0=> Default
#define PTE21_SIG_SEL        0

// Signal mapping for PTE22 pin
//   <o>    PTE22<name=PTE22_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE22 pin
//   <info> ADC0_DP3/ADC0_SE3, GPIOE_22, TPM2_CH0, UART2_TX, FXIO0_D6
//     <-2=> ADC0_DP3/ADC0_SE3 (reset default)<selection=ADC0_DP3_PIN_SEL,PTE22 (reset default)><selection=ADC0_SE3_PIN_SEL,PTE22 (reset default)>
//     <0=> ADC0_DP3/ADC0_SE3<selection=ADC0_DP3_PIN_SEL,PTE22><selection=ADC0_SE3_PIN_SEL,PTE22>
//     <1=> GPIOE_22<selection=GPIOE_22_PIN_SEL,PTE22>
//     <3=> TPM2_CH0<selection=TPM2_CH0_PIN_SEL,PTE22>
//     <4=> UART2_TX<selection=UART2_TX_PIN_SEL,PTE22>
//     <6=> FXIO0_D6<selection=FXIO0_D6_PIN_SEL,PTE22>
//     <-2=> Default
#define PTE22_SIG_SEL        -2

// Signal mapping for PTE23 pin
//   <o>    PTE23<name=PTE23_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE23 pin
//   <info> ADC0_DM3/ADC0_SE7a, GPIOE_23, TPM2_CH1, UART2_RX, FXIO0_D7
//     <-2=> ADC0_DM3/ADC0_SE7a (reset default)<selection=ADC0_DM3_PIN_SEL,PTE23 (reset default)><selection=ADC0_SE7a_PIN_SEL,PTE23 (reset default)>
//     <0=> ADC0_DM3/ADC0_SE7a<selection=ADC0_DM3_PIN_SEL,PTE23><selection=ADC0_SE7a_PIN_SEL,PTE23>
//     <1=> GPIOE_23<selection=GPIOE_23_PIN_SEL,PTE23>
//     <3=> TPM2_CH1<selection=TPM2_CH1_PIN_SEL,PTE23>
//     <4=> UART2_RX<selection=UART2_RX_PIN_SEL,PTE23>
//     <6=> FXIO0_D7<selection=FXIO0_D7_PIN_SEL,PTE23>
//     <-2=> Default
#define PTE23_SIG_SEL        -2

// Signal mapping for PTE24 pin
//   <o>    PTE24 (Alias:D5)<name=PTE24_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE24 pin
//   <info> GPIOE_24, TPM0_CH0, I2C0_SCL
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_24<selection=GPIOE_24_PIN_SEL,PTE24 (Alias:D5)>
//     <3=> TPM0_CH0<selection=TPM0_CH0_PIN_SEL,PTE24 (Alias:D5)>
//     <5=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTE24 (Alias:D5)>
//     <3=> Default
#define PTE24_SIG_SEL        3

// Signal mapping for PTE25 pin
//   <o>    PTE25 (Alias:D3)<name=PTE25_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE25 pin
//   <info> GPIOE_25, TPM0_CH1, I2C0_SDA
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_25<selection=GPIOE_25_PIN_SEL,PTE25 (Alias:D3)>
//     <3=> TPM0_CH1<selection=TPM0_CH1_PIN_SEL,PTE25 (Alias:D3)>
//     <5=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTE25 (Alias:D3)>
//     <3=> Default
#define PTE25_SIG_SEL        3

// Signal mapping for PTE29 pin
//   <o>    PTE29<name=PTE29_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE29 pin
//   <info> CMP0_IN5/ADC0_SE4b, GPIOE_29, TPM0_CH2, TPM_CLKIN0
//     <-2=> CMP0_IN5/ADC0_SE4b (reset default)<selection=CMP0_IN5_PIN_SEL,PTE29 (reset default)><selection=ADC0_SE4b_PIN_SEL,PTE29 (reset default)>
//     <0=> CMP0_IN5/ADC0_SE4b<selection=CMP0_IN5_PIN_SEL,PTE29><selection=ADC0_SE4b_PIN_SEL,PTE29>
//     <1=> GPIOE_29<selection=GPIOE_29_PIN_SEL,PTE29>
//     <3=> TPM0_CH2<selection=TPM0_CH2_PIN_SEL,PTE29>
//     <4=> TPM_CLKIN0<selection=TPM_CLKIN0_PIN_SEL,PTE29>
//     <-2=> Default
#define PTE29_SIG_SEL        -2

// Signal mapping for PTE30 pin
//   <o>    PTE30<name=PTE30_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE30 pin
//   <info> ADC0_SE23/CMP0_IN4, GPIOE_30, TPM0_CH3, TPM_CLKIN1, LPUART1_TX, LPTMR0_ALT1
//     <-2=> ADC0_SE23/CMP0_IN4 (reset default)<selection=ADC0_SE23_PIN_SEL,PTE30 (reset default)><selection=CMP0_IN4_PIN_SEL,PTE30 (reset default)>
//     <0=> ADC0_SE23/CMP0_IN4<selection=ADC0_SE23_PIN_SEL,PTE30><selection=CMP0_IN4_PIN_SEL,PTE30>
//     <1=> GPIOE_30<selection=GPIOE_30_PIN_SEL,PTE30>
//     <3=> TPM0_CH3<selection=TPM0_CH3_PIN_SEL,PTE30>
//     <4=> TPM_CLKIN1<selection=TPM_CLKIN1_PIN_SEL,PTE30>
//     <5=> LPUART1_TX<selection=LPUART1_TX_PIN_SEL,PTE30>
//     <6=> LPTMR0_ALT1<selection=LPTMR0_ALT1_PIN_SEL,PTE30>
//     <-2=> Default
#define PTE30_SIG_SEL        -2

// Signal mapping for PTE31 pin
//   <o>    PTE31 (Alias:D8)<name=PTE31_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE31 pin
//   <info> GPIOE_31, TPM0_CH4
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_31<selection=GPIOE_31_PIN_SEL,PTE31 (Alias:D8)>
//     <3=> TPM0_CH4<selection=TPM0_CH4_PIN_SEL,PTE31 (Alias:D8)>
//     <3=> Default
#define PTE31_SIG_SEL        3

