podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL27Z644-FRDM.h
// </h>

// </e>

// Pin peripheral signal mapping
//   <e> Mapping by Peripheral Function <name=MAP_BY_FUNCTION><constant>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by peripheral function.
//   <i> This option is active when Mapping by Pin is disabled
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_FUNCTION_ENABLED 0

// <h> Analogue to Digital (ADC0)

// Pin Mapping for ADC0_DM0 signal
//   <o>    ADC0_DM0<name=ADC0_DM0_PIN_SEL>
//   <i>    Shows which pin ADC0_DM0 is mapped to
//   <info>  [PTE21]
//     <0=> Disabled
//     <1=> PTE21 (Alias:A3) (reset default)<selection=PTE21_SIG_SEL,ADC0_DM0/ADC0_SE4a (reset default)>
//     <2=> PTE21 (Alias:A3)<selection=PTE21_SIG_SEL,ADC0_DM0/ADC0_SE4a>
//     <2=> Default
#define ADC0_DM0_PIN_SEL     2

// Pin Mapping for ADC0_DM1 signal
//   <o>    ADC0_DM1<name=ADC0_DM1_PIN_SEL>
//   <i>    Shows which pin ADC0_DM1 is mapped to
//   <info>  [PTE17]
//     <0=> Disabled
//     <1=> PTE17 (reset default)<selection=PTE17_SIG_SEL,ADC0_DM1/ADC0_SE5a (reset default)>
//     <2=> PTE17<selection=PTE17_SIG_SEL,ADC0_DM1/ADC0_SE5a>
//     <1=> Default
#define ADC0_DM1_PIN_SEL     1

// Pin Mapping for ADC0_DM3 signal
//   <o>    ADC0_DM3<name=ADC0_DM3_PIN_SEL>
//   <i>    Shows which pin ADC0_DM3 is mapped to
//   <info>  [PTE23]
//     <0=> Disabled
//     <1=> PTE23 (reset default)<selection=PTE23_SIG_SEL,ADC0_DM3/ADC0_SE7a (reset default)>
//     <2=> PTE23<selection=PTE23_SIG_SEL,ADC0_DM3/ADC0_SE7a>
//     <1=> Default
#define ADC0_DM3_PIN_SEL     1

// Pin Mapping for ADC0_DP0 signal
//   <o>    ADC0_DP0<name=ADC0_DP0_PIN_SEL>
//   <i>    Shows which pin ADC0_DP0 is mapped to
//   <info>  [PTE20]
//     <0=> Disabled
//     <1=> PTE20 (Alias:A2) (reset default)<selection=PTE20_SIG_SEL,ADC0_DP0/ADC0_SE0 (reset default)>
//     <2=> PTE20 (Alias:A2)<selection=PTE20_SIG_SEL,ADC0_DP0/ADC0_SE0>
//     <2=> Default
#define ADC0_DP0_PIN_SEL     2

// Pin Mapping for ADC0_DP1 signal
//   <o>    ADC0_DP1<name=ADC0_DP1_PIN_SEL>
//   <i>    Shows which pin ADC0_DP1 is mapped to
//   <info>  [PTE16]
//     <0=> Disabled
//     <1=> PTE16 (Alias:A0) (reset default)<selection=PTE16_SIG_SEL,ADC0_DP1/ADC0_SE1 (reset default)>
//     <2=> PTE16 (Alias:A0)<selection=PTE16_SIG_SEL,ADC0_DP1/ADC0_SE1>
//     <2=> Default
#define ADC0_DP1_PIN_SEL     2

// Pin Mapping for ADC0_DP2 signal
//   <o>    ADC0_DP2<name=ADC0_DP2_PIN_SEL>
//   <i>    Shows which pin ADC0_DP2 is mapped to
//   <info>  [PTE18]
//     <0=> Disabled
//     <1=> PTE18 (reset default)<selection=PTE18_SIG_SEL,ADC0_DP2/ADC0_SE2 (reset default)>
//     <2=> PTE18<selection=PTE18_SIG_SEL,ADC0_DP2/ADC0_SE2>
//     <1=> Default
#define ADC0_DP2_PIN_SEL     1

// Pin Mapping for ADC0_DP3 signal
//   <o>    ADC0_DP3<name=ADC0_DP3_PIN_SEL>
//   <i>    Shows which pin ADC0_DP3 is mapped to
//   <info>  [PTE22]
//     <0=> Disabled
//     <1=> PTE22 (reset default)<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3 (reset default)>
//     <2=> PTE22<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3>
//     <1=> Default
#define ADC0_DP3_PIN_SEL     1

// Pin Mapping for ADC0_SE0 signal
//   <o>    ADC0_SE0<name=ADC0_SE0_PIN_SEL>
//   <i>    Shows which pin ADC0_SE0 is mapped to
//   <info>  [PTE20]
//     <0=> Disabled
//     <1=> PTE20 (Alias:A2) (reset default)<selection=PTE20_SIG_SEL,ADC0_DP0/ADC0_SE0 (reset default)>
//     <2=> PTE20 (Alias:A2)<selection=PTE20_SIG_SEL,ADC0_DP0/ADC0_SE0>
//     <2=> Default
#define ADC0_SE0_PIN_SEL     2

// Pin Mapping for ADC0_SE1 signal
//   <o>    ADC0_SE1<name=ADC0_SE1_PIN_SEL>
//   <i>    Shows which pin ADC0_SE1 is mapped to
//   <info>  [PTE16]
//     <0=> Disabled
//     <1=> PTE16 (Alias:A0) (reset default)<selection=PTE16_SIG_SEL,ADC0_DP1/ADC0_SE1 (reset default)>
//     <2=> PTE16 (Alias:A0)<selection=PTE16_SIG_SEL,ADC0_DP1/ADC0_SE1>
//     <2=> Default
#define ADC0_SE1_PIN_SEL     2

// Pin Mapping for ADC0_SE2 signal
//   <o>    ADC0_SE2<name=ADC0_SE2_PIN_SEL>
//   <i>    Shows which pin ADC0_SE2 is mapped to
//   <info>  [PTE18]
//     <0=> Disabled
//     <1=> PTE18 (reset default)<selection=PTE18_SIG_SEL,ADC0_DP2/ADC0_SE2 (reset default)>
//     <2=> PTE18<selection=PTE18_SIG_SEL,ADC0_DP2/ADC0_SE2>
//     <1=> Default
#define ADC0_SE2_PIN_SEL     1

// Pin Mapping for ADC0_SE3 signal
//   <o>    ADC0_SE3<name=ADC0_SE3_PIN_SEL>
//   <i>    Shows which pin ADC0_SE3 is mapped to
//   <info>  [PTE22]
//     <0=> Disabled
//     <1=> PTE22 (reset default)<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3 (reset default)>
//     <2=> PTE22<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3>
//     <1=> Default
#define ADC0_SE3_PIN_SEL     1

// Pin Mapping for ADC0_SE4b signal
//   <o>    ADC0_SE4b<name=ADC0_SE4b_PIN_SEL>
//   <i>    Shows which pin ADC0_SE4b is mapped to
//   <info>  [PTE29]
//     <0=> Disabled
//     <1=> PTE29 (reset default)<selection=PTE29_SIG_SEL,CMP0_IN5/ADC0_SE4b (reset default)>
//     <2=> PTE29<selection=PTE29_SIG_SEL,CMP0_IN5/ADC0_SE4b>
//     <1=> Default
#define ADC0_SE4b_PIN_SEL    1

// Pin Mapping for ADC0_SE4a signal
//   <o>    ADC0_SE4a<name=ADC0_SE4a_PIN_SEL>
//   <i>    Shows which pin ADC0_SE4a is mapped to
//   <info>  [PTE21]
//     <0=> Disabled
//     <1=> PTE21 (Alias:A3) (reset default)<selection=PTE21_SIG_SEL,ADC0_DM0/ADC0_SE4a (reset default)>
//     <2=> PTE21 (Alias:A3)<selection=PTE21_SIG_SEL,ADC0_DM0/ADC0_SE4a>
//     <2=> Default
#define ADC0_SE4a_PIN_SEL    2

// Pin Mapping for ADC0_SE5b signal
//   <o>    ADC0_SE5b<name=ADC0_SE5b_PIN_SEL>
//   <i>    Shows which pin ADC0_SE5b is mapped to
//   <info>  [PTD1]
//     <0=> Disabled
//     <1=> PTD1 (reset default)<selection=PTD1_SIG_SEL,ADC0_SE5b (reset default)>
//     <2=> PTD1<selection=PTD1_SIG_SEL,ADC0_SE5b>
//     <1=> Default
#define ADC0_SE5b_PIN_SEL    1

// Pin Mapping for ADC0_SE5a signal
//   <o>    ADC0_SE5a<name=ADC0_SE5a_PIN_SEL>
//   <i>    Shows which pin ADC0_SE5a is mapped to
//   <info>  [PTE17]
//     <0=> Disabled
//     <1=> PTE17 (reset default)<selection=PTE17_SIG_SEL,ADC0_DM1/ADC0_SE5a (reset default)>
//     <2=> PTE17<selection=PTE17_SIG_SEL,ADC0_DM1/ADC0_SE5a>
//     <1=> Default
#define ADC0_SE5a_PIN_SEL    1

